lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
/**
 * @file animation.c
 * @brief 320x320 20fps raw RGB565 animation playback engine
 *
 * Phase 6: Raw RGB565 frames stored on QSPI Flash (no JPEG decode).
 * DMA2D copies directly from QSPI memory-mapped region (0x90000000)
 * to the inactive framebuffer. No JPEG decode, no intermediate buffer.
 *
 * Uses FreeRTOS 50ms timer + semaphore for frame pacing.
 */

#include "animation.h"
#include "lcd.h"
#include "ltdc.h"
#include "qspi_video.h"
#include "qspi_flash.h"
#include "dma2d.h"
#include "gpio.h"
#include "cmsis_os2.h"
#include <stdio.h>
#include <string.h>
#include "stm32h7xx.h"

/* Number of frames (read from QSPI Flash at init) */
static uint32_t num_frames = 0;

/* Semaphore for timer-to-task synchronization */
static osSemaphoreId_t anim_sem_id = NULL;

/* Current frame index (incremented by timer callback) */
static volatile int frame_index = 0;

/* DMA2D handle (initialized by CubeMX in dma2d.c) */
extern DMA2D_HandleTypeDef hdma2d;

/* LTDC handle (initialized by CubeMX in ltdc.c) */
extern LTDC_HandleTypeDef hltdc;

/*---------------------------------------------------------------------------
 * Double buffering
 *---------------------------------------------------------------------------
 * Two full framebuffers in SDRAM, 1.5MB each (1600*480*2).
 * The animation writes to the INACTIVE buffer, then swaps the LTDC
 * layer address at VSYNC using the shadow register mechanism.
 */
#define FB_FRONT       0xC0000000U
#define FB_BACK        0xC0180000U

static uint32_t fb_active = FB_FRONT;

/* LVGL page background colour (RGB565). Change to set PAGE_LVGL background.
 * Examples: 0xFFFF=white, 0x0000=black, 0xF800=red, 0x07E0=green, 0x001F=blue.
 */
#define LVGL_BG_COLOR_RGB565 0x0000U

/* Current page state (default: animation page) */
volatile PageState_t current_page = PAGE_ANIMATION;

/* Previous button states for falling-edge detection (1 = released, active low) */
static uint8_t prev_key0 = 1;

/* Previous state for KEY2 falling-edge detection (1 = released, active low) */
static uint8_t prev_key2 = 1;

/*---------------------------------------------------------------------------
 * Swap LTDC layer to a new framebuffer address (immediate)
 *---------------------------------------------------------------------------
 * Since we write to the INACTIVE buffer and only switch after DMA2D
 * completes, the LTDC is never reading the buffer being written to.
 * Immediate switch is safe — no tearing, no VSYNC wait jitter.
 */
static void SwapFramebuffer(uint32_t new_fb)
{
    LTDC_Layer1->CFBAR = new_fb;
    fb_active = new_fb;
}

/*---------------------------------------------------------------------------
 * CPU: 90 deg CW rotate + copy animation frame from QSPI to SDRAM
 *---------------------------------------------------------------------------
 * Source: QSPI memory-mapped (0x90000000 + offset), 320x320 landscape
 * Destination: physical framebuffer at (ANIM_DST_X, ANIM_DST_Y), rotated
 *
 * The panel is physically mounted 90 deg CCW relative to the LTDC output.
 * We pre-rotate data 90 deg CW so the panel rotation cancels out and
 * produces an upright portrait display.
 *
 * Rotation: source (sx, sy) -> physical (ANIM_DST_X + (319-sy), ANIM_DST_Y + sx)
 * Read source sequentially (row-major) for best QSPI throughput.
 */
static void CopyFrame(const uint16_t *src, uint16_t *dst_base)
{
    for (int sy = 0; sy < ANIM_FRAME_HEIGHT; sy++)
    {
        for (int sx = 0; sx < ANIM_FRAME_WIDTH; sx++)
        {
            int px = ANIM_DST_X + (ANIM_FRAME_WIDTH - 1 - sy);  /* 319 - sy */
            int py = ANIM_DST_Y + sx;
            dst_base[py * LCD_FB_STRIDE + px] = src[sy * ANIM_FRAME_WIDTH + sx];
        }
    }
}

static const uint8_t digit_font[10][16] = {
    {0x00,0x00,0x00,0x00,0x3C,0x66,0x6E,0x76,0x66,0x66,0x3C,0x00,0x00,0x00,0x00,0x00}, /* 0 */
    {0x00,0x00,0x00,0x00,0x18,0x38,0x18,0x18,0x18,0x18,0x7E,0x00,0x00,0x00,0x00,0x00}, /* 1 */
    {0x00,0x00,0x00,0x00,0x3C,0x66,0x06,0x0C,0x18,0x30,0x7E,0x00,0x00,0x00,0x00,0x00}, /* 2 */
    {0x00,0x00,0x00,0x00,0x3C,0x66,0x06,0x1C,0x06,0x66,0x3C,0x00,0x00,0x00,0x00,0x00}, /* 3 */
    {0x00,0x00,0x00,0x00,0x0C,0x1C,0x3C,0x6C,0x7E,0x0C,0x0C,0x00,0x00,0x00,0x00,0x00}, /* 4 */
    {0x00,0x00,0x00,0x00,0x7E,0x60,0x7C,0x06,0x06,0x66,0x3C,0x00,0x00,0x00,0x00,0x00}, /* 5 */
    {0x00,0x00,0x00,0x00,0x1C,0x30,0x60,0x7C,0x66,0x66,0x3C,0x00,0x00,0x00,0x00,0x00}, /* 6 */
    {0x00,0x00,0x00,0x00,0x7E,0x06,0x0C,0x18,0x30,0x30,0x30,0x00,0x00,0x00,0x00,0x00}, /* 7 */
    {0x00,0x00,0x00,0x00,0x3C,0x66,0x66,0x3C,0x66,0x66,0x3C,0x00,0x00,0x00,0x00,0x00}, /* 8 */
    {0x00,0x00,0x00,0x00,0x3C,0x66,0x66,0x3E,0x06,0x0C,0x38,0x00,0x00,0x00,0x00,0x00}, /* 9 */
};

/*---------------------------------------------------------------------------
 * RGB565 to ARGB1555 conversion (for LTDC Layer 2 UI buffer)
 *   ARGB1555: bit15=alpha(1=opaque), bits14-10=R, bits9-5=G, bits4-0=B
 *   RGB565:   bits15-11=R, bits10-5=G, bits4-0=B
 *---------------------------------------------------------------------------
 */
static inline uint16_t rgb565_to_argb1555(uint16_t rgb565)
{
    return 0x8000 | ((rgb565 & 0xF800) >> 1) | ((rgb565 & 0x07C0) >> 1) | (rgb565 & 0x001F);
}

/*---------------------------------------------------------------------------
 * Clear LTDC Layer 2 UI buffer to transparent (ARGB1555=0x0000)
 *---------------------------------------------------------------------------
 */
static void ClearLayer2_Transparent(void)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;
    for (uint32_t i = 0; i < 800 * 480; i++)
    {
        ui_buf[i] = 0x0000;
    }
    /* Clean D-Cache so LTDC reads the cleared (transparent) data from SDRAM.
     * Without this, LTDC sees stale SDRAM content from the previous page,
     * which can cause a black background when stale opaque pixels block
     * the white animation layer.
     */
    SCB_CleanDCache_by_Addr((uint32_t *)UI_BUF_ADDR, 800 * 480 * sizeof(uint16_t));
}

/*---------------------------------------------------------------------------
 * Clear LTDC Layer 2 UI buffer to opaque black (ARGB1555=0x8000)
 *---------------------------------------------------------------------------
 */
static void ClearLayer2_OpaqueBlack(void)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;
    for (uint32_t i = 0; i < 800 * 480; i++)
    {
        ui_buf[i] = 0x8000;
    }
}

