lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
/*---------------------------------------------------------------------------
 * Fill LTDC Layer 2 UI buffer to opaque black (ARGB1555=0x8000)
 * Used when switching to LVGL/Brightness pages to pre-fill the background
 * before LVGL renders its widgets. This prevents the visible band-by-band
 * background painting that occurs when LVGL flushes each 480x80 band.
 *
 * All three pages (Animation, LVGL, Brightness) use black backgrounds, so
 * pre-filling with opaque black avoids any white flash during transitions.
 *
 * ARGB1555 opaque black: alpha=1, R=0, G=0, B=0 = 0x8000
 * Uses DMA2D R2M for fast fill, then cleans D-Cache so LTDC reads the data.
 *---------------------------------------------------------------------------
 */
static void FillLayer2_OpaqueBlack(void)
{
    /* Use a local DMA2D configuration to avoid disturbing the global hdma2d
     * handle which may be configured for RGB565 output. We configure for
     * ARGB1555 output to match the Layer 2 buffer format.
     */
    DMA2D_HandleTypeDef hdma2d_local;
    hdma2d_local.Instance = DMA2D;
    hdma2d_local.Init.Mode         = DMA2D_R2M;
    hdma2d_local.Init.ColorMode    = DMA2D_OUTPUT_ARGB1555;
    hdma2d_local.Init.OutputOffset = 0;
    hdma2d_local.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d_local.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d_local);

    /* ARGB8888 opaque black = 0xFF000000 (Alpha=0xFF, R=0, G=0, B=0)
     * The HAL DMA2D_SetConfig() expects the input color in ARGB8888 format and
     * converts it to the target output format (ARGB1555). The conversion logic
     * extracts alpha from bit31, red from bits 23:16, green from bits 15:8, blue
     * from bits 7:0. So 0xFF000000 correctly produces ARGB1555 0x8000 (opaque black).
     * Previously 0x00008000 was used, which has bit31=0 → alpha=0 → transparent!
     */
    HAL_DMA2D_Start(&hdma2d_local, 0xFF000000, UI_BUF_ADDR, UI_BUF_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d_local, 100);

    /* Clean D-Cache so LTDC reads the freshly filled black pixels from SDRAM */
    /* Layer 2 buffer is 800 (physical width) x 480 (physical height) = 384,000 pixels */
    SCB_CleanDCache_by_Addr((uint32_t *)UI_BUF_ADDR, UI_BUF_STRIDE * 480 * sizeof(uint16_t));
}

/*---------------------------------------------------------------------------
 * Pre-render static overlay elements to LTDC Layer 2 UI buffer
 * Called once at startup. Draws bottom bar + clean_text on the UI buffer.
 * Layer 2 uses ARGB1555 format: alpha=1 for overlay, alpha=0 for transparent.
 *---------------------------------------------------------------------------
 */
static void DrawTextLineCenter(uint16_t log_y, const char *text, uint16_t color);

static void PreRenderUI(void)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;

    /* Bottom bar: 320x134 RGB565, 90 deg CCW rotation */
    const uint16_t *bar_src = (const uint16_t *)_binary_bottom_bar_raw_start;
    for (int sy = 0; sy < BAR_HEIGHT; sy++)
    {
        for (int sx = 0; sx < BAR_WIDTH; sx++)
        {
            /* 90 deg CCW: source (sx, sy) -> physical (BAR_DST_X + sy, BAR_DST_Y + (BAR_WIDTH-1-sx)) */
            int px = BAR_DST_X + sy;
            int py = BAR_DST_Y + (BAR_WIDTH - 1 - sx);
            ui_buf[py * UI_BUF_STRIDE + px] = rgb565_to_argb1555(bar_src[sy * BAR_WIDTH + sx]);
        }
    }

    /* Clean text: 140x116 RGB565, 90 deg CCW rotation, full image (with black bg) */
    const uint16_t *text_rgb = (const uint16_t *)_binary_clean_text_rgb_raw_start;
    for (int sy = 0; sy < OVLY_LOGICAL_H; sy++)
    {
        for (int sx = 0; sx < OVLY_LOGICAL_W; sx++)
        {
            /* 90 deg CCW: source (sx, sy) -> physical (OVLY_DST_X + sy, OVLY_DST_Y + (OVLY_LOGICAL_W-1-sx)) */
            int px = OVLY_DST_X + sy;
            int py = OVLY_DST_Y + (OVLY_LOGICAL_W - 1 - sx);
            ui_buf[py * UI_BUF_STRIDE + px] = rgb565_to_argb1555(text_rgb[sy * OVLY_LOGICAL_W + sx]);
        }
    }

    /*---------------------------------------------------------------------------
     * 320x480 blue border rectangle, 2px thick, centered on portrait display.
     *   Logical: (80, 160) to (400, 640) = 320x480, centered 480x800 portrait.
     *   After 90° CCW panel rotation to physical (800x480):
     *     Top edge    (logical y=160,161)  → physical x=160,161; y=79..399  (2px wide vertical)
     *     Bottom edge (logical y=639,640)  → physical x=639,640; y=79..399  (2px wide vertical)
     *     Left edge   (logical x=80,81)    → physical y=398,399; x=160..640 (2px thick horizontal)
     *     Right edge  (logical x=399,400)  → physical y=79,80;   x=160..640 (2px thick horizontal)
     *   Interior is transparent (ARGB1555=0x0000) → animation shows through.
     *   Drawn after bottom_bar/clean_text to be on top.
     *---------------------------------------------------------------------------
     */
    #define BLUE_BORDER_ARGB1555  0x801F   /* ARGB1555: A=1, R=0, G=0, B=31 */

    /* Top edge: physical vertical lines at x=160,161, y=79..399 */
    for (int y = 79; y <= 399; y++)
    {
        ui_buf[y * UI_BUF_STRIDE + 160] = BLUE_BORDER_ARGB1555;
        ui_buf[y * UI_BUF_STRIDE + 161] = BLUE_BORDER_ARGB1555;
    }
    /* Bottom edge: physical vertical lines at x=639,640, y=79..399 */
    for (int y = 79; y <= 399; y++)
    {
        ui_buf[y * UI_BUF_STRIDE + 639] = BLUE_BORDER_ARGB1555;
        ui_buf[y * UI_BUF_STRIDE + 640] = BLUE_BORDER_ARGB1555;
    }
    /* Left edge: physical horizontal lines at y=398,399, x=160..640 */
    for (int x = 160; x <= 640; x++)
    {
        ui_buf[398 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
        ui_buf[399 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
    }
    /* Right edge: physical horizontal lines at y=79,80, x=160..640 */
    for (int x = 160; x <= 640; x++)
    {
        ui_buf[79 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
        ui_buf[80 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
    }

    /*---------------------------------------------------------------------------
     * Three lines centered above the 320px rectangle.
     *   Logical y=70  → "animation demo"
     *   Logical y=102 → "STM32H743IIT6"
     *   Logical y=134 → "20fps"
     *   White text (0xFFFF), transparent background.
     *---------------------------------------------------------------------------
     */
    DrawTextLineCenter(70,  "animation demo",   0xFFFF);
    DrawTextLineCenter(102, "STM32H743IIT6",    0xFFFF);
    DrawTextLineCenter(134, "20fps",            0xFFFF);
}

/* Font metrics for frame number (8x16 bitmap, 2x scaled) */
#define FONT_SCALE   2
#define CHAR_W       (8 * FONT_SCALE)   /* 16 px */

/* Use LVGL Montserrat 24 font — anti-aliased, much better than 8x16 bitmap */
#include "src/font/lv_font.h"
LV_FONT_DECLARE(lv_font_montserrat_24);
#define LV_FONT (&lv_font_montserrat_24)

#include "lv_demo.h"

/* LVGL screen references for page switching (create once, load on switch) */
static lv_obj_t *lvgl_screen = NULL;
static lv_obj_t *brightness_screen = NULL;

