lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
    /* Now atomically switch LTDC to the fully-initialized buffer */
    LTDC_Layer1->CFBAR = inactive_fb;
    fb_active = inactive_fb;

    /* Fill the now-inactive (previously active) buffer so both are initialized */
    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, LVGL_BG_COLOR_RGB565, other_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)other_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Ensure LVGL demo screen is created (once) and loaded.
     * Using separate screens avoids the race condition and memory corruption
     * caused by lv_obj_clean() + recreate on rapid page switches.
     */
    if (lv_is_initialized()) {
        if (lvgl_screen == NULL) {
            lvgl_screen = lv_obj_create(NULL);
            lvgl_demo_create(lvgl_screen);
        }
        lv_scr_load(lvgl_screen);
        lv_obj_invalidate(lvgl_screen);
        lv_refr_now(NULL);
    }

    printf("PAGE: switched to LVGL\r\n");
}

/*---------------------------------------------------------------------------
 * Switch back to animation page: restore UI overlays on Layer 2
 *---------------------------------------------------------------------------
 */
static void SwitchToAnimationPage(void)
{
    /* STEP 1: Fill both animation framebuffers to black FIRST.
     * This ensures the background is already black before any UI elements
     * appear on Layer 2. Doing this after PreRenderUI causes a visible
     * flicker: white background + UI elements → background turns black.
     */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    /* Clear back buffer via DMA2D R2M */
    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0x00000000, FB_BACK, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)FB_BACK, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Clear front buffer via DMA2D R2M */
    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0x00000000, FB_FRONT, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)FB_FRONT, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Ensure LTDC uses the front buffer and update tracking variable */
    LTDC_Layer1->CFBAR = FB_FRONT;
    fb_active = FB_FRONT;

    /* STEP 2: Now clear Layer 2 to transparent and re-render UI overlays.
     * The background is already black, so UI elements will appear on a
     * dark background with no flicker.
     */
    ClearLayer2_Transparent();
    PreRenderUI();

    printf("PAGE: switched to Animation (buffers cleared)\r\n");
}

/*---------------------------------------------------------------------------
 * Switch to Brightness page: same as LVGL page but with "Brightness" text
 *---------------------------------------------------------------------------
 */
static void SwitchToBrightnessPage(void)
{
    /*---------------------------------------------------------------------------
     * Same fix as SwitchToLVGLPage: pre-fill Layer 2 with opaque black before
     * loading the LVGL screen, preventing the band-by-band background paint
     * flash. All three pages use black backgrounds, so no white flash.
     *---------------------------------------------------------------------------
     */
    FillLayer2_OpaqueBlack();

    /* Fill both animation framebuffers (Layer 1) with black. Since Layer 2 is
     * already filled with opaque black, the content of Layer 1 is completely
     * hidden. We fill Layer 1 to black for consistency and to avoid stale
     * animation pixels in case of future layer reconfiguration.
     */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    uint32_t inactive_fb = (fb_active == FB_FRONT) ? FB_BACK : FB_FRONT;
    uint32_t other_fb = (inactive_fb == FB_FRONT) ? FB_BACK : FB_FRONT;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, LVGL_BG_COLOR_RGB565, inactive_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)inactive_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    LTDC_Layer1->CFBAR = inactive_fb;
    fb_active = inactive_fb;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, LVGL_BG_COLOR_RGB565, other_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)other_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Set up Brightness LVGL screen (create once, load on switch) */
    if (lv_is_initialized()) {
        if (brightness_screen == NULL) {
            brightness_screen = lv_obj_create(NULL);
            lvgl_brightness_create(brightness_screen);
        }
        lv_scr_load(brightness_screen);
        lv_obj_invalidate(brightness_screen);
        lv_refr_now(NULL);
    }

    printf("PAGE: switched to Brightness\r\n");
}

/*---------------------------------------------------------------------------
 * Draw frame number on LTDC Layer 2 UI buffer (ARGB1555)
 * Called every frame. White text on transparent background.
 * Uses UI_BUF_STRIDE (800) instead of LCD_FB_STRIDE (1600).
 *---------------------------------------------------------------------------
 */
static void DrawFrameNumberUI(int num)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;
    char buf[8];
    int len = sprintf(buf, "%d", num);
    int x, y, row, col, sx, sy;

    for (int i = 0; i < len; i++)
    {
        int idx = buf[i] - '0';
        if (idx < 0 || idx > 9) continue;

        for (row = 0; row < 16; row++)
        {
            uint8_t line = digit_font[idx][row];
            for (col = 0; col < 8; col++)
            {
                /* ARGB1555: 0xFFFF = white opaque, 0x0000 = transparent */
                uint16_t pixel = (line & (0x80 >> col)) ? 0xFFFF : 0x0000;
                for (sy = 0; sy < FONT_SCALE; sy++)
                {
                    for (sx = 0; sx < FONT_SCALE; sx++)
                    {
                        x = FN_X + i * CHAR_W + col * FONT_SCALE + sx;
                        y = FN_Y + row * FONT_SCALE + sy;
                        if (x < 800 && y < 480)
                            ui_buf[y * UI_BUF_STRIDE + x] = pixel;
                    }
                }
            }
        }
    }
}

