lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
/*---------------------------------------------------------------------------
 * Timer callback (50ms = 20fps)
 *---------------------------------------------------------------------------
 */
void AnimTimerCallback(void *argument)
{
    (void)argument;
    if (num_frames > 0)
    {
        frame_index = (frame_index + 1) % num_frames;
    }
    osSemaphoreRelease(anim_sem_id);
}

/*---------------------------------------------------------------------------
 * Animation task
 *---------------------------------------------------------------------------
 */
void StartAnimationTask(void *argument)
{
    (void)argument;

    /* Give defaultTask time to finish init (LCD, USART, QSPI, etc.) */
    osDelay(500);

    /* Create binary semaphore: max count = 1, initial count = 0 */
    anim_sem_id = osSemaphoreNew(1, 0, NULL);

    /* Clear both framebuffers to black */
    LCD_Clear(LCD_COLOR_BLACK);

    /* Clear back buffer using DMA2D R2M */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0x00000000, FB_BACK, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 10);
    /* Clean D-cache for the cleared back buffer */
    SCB_CleanDCache_by_Addr((uint32_t *)FB_BACK, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Pre-render static overlays (bottom_bar, clean_text, rectangle, title text)
     * to LTDC Layer 2 UI buffer immediately after clearing the framebuffers.
     * This ensures UI elements are visible from the very first frame, before
     * any potentially slow QSPI initialization.
     */
    PreRenderUI();

    /* Write header + frame table to QSPI Flash (first boot only, uses direct QSPI commands) */
    if (QSPI_Video_WriteToFlash() != HAL_OK)
    {
        printf("ANIM: QSPI header write failed\r\n");
        osDelay(1000);
        NVIC_SystemReset();
    }

    /* Check if frame data is present (direct QSPI read, no mmap needed) */
    if (!QSPI_Video_IsDataProgrammed())
    {
        printf("ANIM: Frame data not found, entering programming mode...\r\n");
        if (QSPI_Video_ProgramFrameData() != HAL_OK)
        {
            printf("ANIM: Frame data programming failed\r\n");
            osDelay(1000);
            NVIC_SystemReset();
        }
        printf("ANIM: Frame data programmed, resetting...\r\n");
        osDelay(500);
        NVIC_SystemReset();
    }

    /* Enable QSPI memory-mapped mode for DMA2D direct access */
    if (QSPI_EnableMemoryMappedMode() != HAL_OK)
    {
        printf("ANIM: QSPI mmap failed\r\n");
        osDelay(1000);
        NVIC_SystemReset();
    }

    /* Get number of frames from QSPI Flash (now mmap is active) */
    num_frames = QSPI_Video_GetFrameCount();

    /* Enable DWT cycle counter for profiling */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    printf("Animation Phase 6: Raw RGB565 QSPI, %lu frames, %dx%d at %dfps\r\n",
           num_frames, ANIM_FRAME_WIDTH, ANIM_FRAME_HEIGHT, ANIM_FPS);

    for (;;)
    {
        /* Wait for 50ms timer to signal next frame */
        osSemaphoreAcquire(anim_sem_id, osWaitForever);

        /*---------------------------------------------------------------------------
         * Poll KEY0 and KEY2 for page cycling (50ms debounce, falling edge)
         * KEY0 = PH3, KEY2 = PH2, both active low
         * KEY2 = previous page, KEY0 = next page, 3-page circular loop
         *---------------------------------------------------------------------------
         */
        {
            uint8_t key0 = (HAL_GPIO_ReadPin(KEY0_GPIO_Port, KEY0_Pin) == GPIO_PIN_RESET) ? 0 : 1;
            uint8_t key2 = (HAL_GPIO_ReadPin(KEY2_GPIO_Port, KEY2_Pin) == GPIO_PIN_RESET) ? 0 : 1;

            /* Debug: log key state changes */
            if (key0 != prev_key0 || key2 != prev_key2)
            {
                printf("DEBUG_KEYS: key0=%d key2=%d\r\n", key0, key2);
            }

            /* KEY0 falling edge: advance to next page (0→1→2→0→...)
             * Set current_page BEFORE calling switch function to prevent the
             * defaultTask (which runs lv_task_handler() when current_page == PAGE_LVGL)
             * from calling LVGL functions concurrently with lv_refr_now(NULL) inside
             * the switch function. This avoids a race condition that causes a crash
             * when switching to Brightness page via KEY0 (LVGL → Brightness).
             */
            if (prev_key0 == 1 && key0 == 0)
            {
                PageState_t next = (current_page + 1) % 3;
                current_page = next;
                switch (next) {
                    case PAGE_ANIMATION:  SwitchToAnimationPage();  break;
                    case PAGE_LVGL:       SwitchToLVGLPage();       break;
                    case PAGE_BRIGHTNESS: SwitchToBrightnessPage(); break;
                }
            }

            /* KEY2 falling edge: go to previous page (0→2→1→0→...) */
            if (prev_key2 == 1 && key2 == 0)
            {
                PageState_t prev = (current_page + 2) % 3;  /* -1 mod 3 */
                current_page = prev;
                switch (prev) {
                    case PAGE_ANIMATION:  SwitchToAnimationPage();  break;
                    case PAGE_LVGL:       SwitchToLVGLPage();       break;
                    case PAGE_BRIGHTNESS: SwitchToBrightnessPage(); break;
                }
            }



            prev_key0 = key0;
            prev_key2 = key2;
        }

        /* Skip rendering when not on the animation page (keep polling buttons) */
        if (current_page != PAGE_ANIMATION)
        {
            continue;
        }

        uint32_t t0 = DWT->CYCCNT;

        /* Get QSPI memory-mapped address for this frame */
        uint32_t src_addr = QSPI_Video_GetFrameAddr(frame_index);
        if (src_addr == 0)
        {
            printf("ANIM: Invalid frame address for frame %d\r\n", frame_index);
            continue;
        }

        uint32_t t1 = DWT->CYCCNT;

        /* Determine the inactive framebuffer */
        uint32_t fb_dst = (fb_active == FB_FRONT) ? FB_BACK : FB_FRONT;

        /* CPU rotate + copy animation frame (CopyFrame adds ANIM_DST_X/Y internally) */
        CopyFrame((const uint16_t *)src_addr, (uint16_t *)fb_dst);
        /* Clean D-cache for the destination framebuffer so LTDC reads updated data */
        SCB_CleanDCache_by_Addr((uint32_t *)fb_dst, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));
        uint32_t t2 = DWT->CYCCNT;

        /* Draw frame number on LTDC Layer 2 UI buffer (ARGB1555, transparent bg) */
        DrawFrameNumberUI(frame_index);

        /* Swap LTDC Layer 1 (animation) to the inactive buffer */
        SwapFramebuffer(fb_dst);
        uint32_t t3 = DWT->CYCCNT;

        /* Print timing every 20 frames (HCLK=200MHz → 1 tick = 5ns) */
        if ((frame_index % 20) == 0)
        {
            printf("  T:%d addr=%luus CPUrot=%luus swap=%luus\r\n",
                   frame_index,
                   (t1 - t0) / 200,
                   (t2 - t1) / 200,
                   (t3 - t2) / 200);
        }
    }
}